# =	                x = 5           	x = 5	

# +=	            x += 3          	x = x + 3	

# -=	            x -= 3          	x = x - 3	

# *=	            x *= 3	            x = x * 3	

# /=	            x /= 3	            x = x / 3	

# %=	            x %= 3	            x = x % 3	

# //=	            x //= 3	            x = x // 3	

# **=	            x **= 3	            x = x ** 3	

# &=	            x &= 3	            x = x & 3	(and)

# |=	            x |= 3	            x = x | 3	(or)

# ^=	            x ^= 3	            x = x ^ 3	(xor)

# >>=	            x >>= 3	            x = x >> 3 (Битовый сдвиг влево)

# <<=	            x <<= 3	            x = x << 3 (Битовый сдвиг вправо)